app/Controllers/user/Aktivitasctrl.php

    public function index()
    {
        // SEO
        $metaModel = new MetaModel();
        $meta = $metaModel->where('nama_halaman', 'Aktivitas')->first();

        $canonicalUrl = base_url('/aktivitas');
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'meta' => $meta,
            'canonicalUrl' => $canonicalUrl,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Aktivitas'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`

    public function detailBySlug($slug)
    {
        // Cari aktivitas berdasarkan slug (slug_en atau slug_in)
        $aktivitas = $this->AktivitasModel
                          ->where('slug_en', $slug)
                          ->orWhere('slug_in', $slug)
                          ->first();

        // Jika aktivitas tidak ditemukan, lemparkan error 404
        if (!$aktivitas) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Aktivitas tidak ditemukan');
        }

        $data = [
            'profil' => $this->ProfilModel->findAll(), // Perbaikan pengambilan profil
            'tbaktivitas' => $aktivitas,
        ];
---
SELECT *
FROM `tb_aktivitas`
WHERE `slug_en` = 'komunitas-porsche'
OR `slug_in` = 'komunitas-porsche'
 LIMIT 1
SELECT *
FROM `tb_profil`