app/Controllers/user/Artikelctrl.php

    public function index()
    {
        $metaModel = new MetaModel();
        $meta = $metaModel->where('nama_halaman', 'Artikel')->first();
        $canonicalUrl = base_url('/artikel');
        $lang = session()->get('lang') ?? 'en';

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
            'meta' => $meta,
            'canonicalUrl' => $canonicalUrl,
            'lang' => $lang,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Artikel'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`

    public function detailBySlug($slug)
    {
        // Cari artikel berdasarkan slug dalam bahasa Indonesia dan Inggris
        $artikel = $this->ArtikelModel->where('slug_in', $slug)->orWhere('slug_en', $slug)->first();

        if (!$artikel) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Artikel dengan slug $slug tidak ditemukan");
        }

        $lang = session('lang') ?? 'in'; // Ambil bahasa dari session

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => $artikel,
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($artikel->id_artikel, 4),
            'lang' => $lang
        ];
---
SELECT *
FROM `tb_artikel`
WHERE `slug_in` = 'the-most-popular-porsche-cars-among-buyers-year-after-year-that-still-remain-favorites-today'
OR `slug_en` = 'the-most-popular-porsche-cars-among-buyers-year-after-year-that-still-remain-favorites-today'
 LIMIT 1
SELECT *
FROM `tb_profil`