app/Controllers/user/Productsctrl.php

    public function index()
    {
        $meta = $this->MetaModel->where('nama_halaman', 'Produk')->first();
        $canonicalUrl = base_url('/product');

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'meta' => $meta,
            'canonicalUrl' => $canonicalUrl,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Produk'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`